//-------------------------------------------------------------------------------------WRITTEN BY nauticalmile
//---------------------------------------------------------------------------------------------------------

class springProperty{
  //-----MEMBERS-------------------------------------------------------------------------------MEMBERS
  int springType;
  float d;//---------------線径
  float oD;//--------------外径
  float D;//---------------平均径
  float iD;//--------------内径
  float Nt;//--------------総巻き数
  float Na;//--------------有効巻き数
  float Nb;//---------------座巻き数
  float L;//--------------自由高さ
  float Hs;//-------------密着高さ
  float p;//--------------ピッチ
  float Pl;//-------------初張力
  float c;//--------------ばね指数
  float G;//---------------横弾性係数
  float P;//---------------バネにかかる荷重
  float delta;//-----------バネのたわみ
  float k;//---------------バネ定数
  float tau0;//------------ねじり応力
  float tau;//-------------ねじり修正応力
  float taui;//------------初応力
  float X;//---------------応力修正係数
  float f;//---------------振動数
  float U;//---------------バネに蓄えられるエネルギー
  float omega;//-----------材料の単位体積当たりの質量
  float W;//---------------バネの運動部分の質量
  float g;//---------------重力加速度
  float H1;//--------------取り付け高さ(第一荷重高さ)
  float P1;//--------------取り付け荷重(第一荷重)
  float t1;//--------------応力１
  float H2;//--------------使用高さ(第二荷重高さ)
  float P2;//--------------使用荷重(第二荷重高さ)
  float t2;//--------------応力２
  
  
  //-------------------------------------------------------------------------------------------METHODS
  //--------------------------------------------------------------------------------CONSTRUCTOR
  springProperty(){
  }
  
  //RENDERER FUNCTION------------------------------------------------------------RENDER FUNCTION
  void render(){
  }
  
  //--------------------------------------------------------------------------RUN THE CALCULATION
  Boolean run(){
    
    return true;
  }
  
}
    
    
    
